Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_complaints/where_to_complain_about_professionals_and_others.html.txt.tmx
Source language: en
Languages: ga

source: Where to complain about a professional and others
ga: Cén áit le gearán a dhéanamh faoi dhaoine gairmiúla agus daoine eile

source: Many professions and skilled groups have professional bodies to represent their interests
ga: Tá comhlachtaí gairmiúla ag go leor gairmeacha agus grúpaí scile chun a gcuid leasanna a chur ar aghaidh

source: Most of these organisations maintain professional standards either through the provision of training or the accreditation of new professionals
ga: Cothabhálann go leor de na heagraíochtaí seo caighdeáin ghairmiúla trí thraenáil nó creidiúnú dhaoine gairmiúla eile

source: Some have mechanisms for investigating complaints where their members do not adhere to the required professional standards
ga: Tá meicníochtaí ag roinnt acu le fiosrú a dhéanamh maidir le gearáin nuair nach gcloíonn ball le caighdeáin ghairmiúla riachtanacha

source: Some have statutory responsibility for investigating such complaints
ga: Tá freagracht reachtúil ag roinnt acu le gearáin a fhiosrú

source: If you have a complaint about a member of one of the following professions it is worthwhile to contact the relevant representative organisation which may be able to help you
ga: Má tá gearán agat faoi bhall de na gairmeacha seo a leanas, is fiú dul i dteagmháil le hionadaí cuí na heagraíochta a d’fhéadfadh cuidiú leat

source: The Law Society is the statutory regulatory body for solicitors
ga: Is é an Cumann Dlí an comhlacht reachtúil do dhlíodóirí

source: It makes regulations on among other things, standards and conduct
ga: Déanann sé rialúcháin ar chaighdeáin agus ar iompar i measc rudaí eile,

source: It administers a compensation fund for losses suffered by clients through defaulting solicitors
ga: Rialaíonn sé ciste cúitimh do chailliúintí fulaingthe ag cliaint trí dhlíodóirí mainneachtana

source: It has appointed an Independent Adjudicator
ga: Tá Breitheamh Neamhspleách ceaptha aige (féach thíos)

source: The Independent Adjudicator of the Law Society’s role is to ensure that complaints about the conduct of a solicitor are dealt with fairly and impartially by the Law Society
ga: Is é ról Bhreitheamh Neamhspleách an Chumainn Dlí ná a chinntiú go ndéileálann an Cumann Dlí go cothrom agus go neamhchlaonta le gearán faoi iompar dlíodóra

source: The Adjudicator cannot investigate at first hand a complaint about a solicitor
ga: Ní féidir leis an mBreitheamh féin gearán a fhiosrú

source: Complaints about solicitors provided by the Legal Aid Board should be made as per the Legal Aid Board's complaints procedure
ga: Ba chóir gearáin maidir le dlíodóirí ar fáil ag an mBord um Chúnamh Dlíthiúil a dhéanamh chuig an mBord um Chúnamh Dlíthiúil

source: The Bar Council controls and regulates the professional conduct of barristers
ga: Rialaíonn Comhairle an Bharra iompar gairmiúil na n-abhcóidí

source: The Teaching Council maintains a register of teachers and regulates the teaching profession and the professional conduct of teachers
ga: Coimeádann an Chomhairle Mhúinteoireachta clár múinteoirí agus rialaíonn siad gairm na múinteoireachta agus iompar gairmiúil múinteoirí

source: It does not become involved in day-to-day contractual or disciplinary matters or complaints which can be dealt with more appropriately at local level
ga: Ní bhíonn baint acu i saincheisteanna conarthacha nó disciplíneacha laethúla ná le gearáin ar féidir déileáil níos fearr leo ar leibhéal áitiúil

source: The Council’s role is limited to issues of serious professional misconduct or cases where a teacher is the subject of a criminal conviction
ga: Tá teorainn ar fheidhm na Comhairle agus ní dhéileáiltear ach le mí-iompar tromchúiseach gairmiúil nó le cásanna ina bhfuil an múinteoir ina ábhar ciontaithe choiriúil

source: Such issues may lead to withdrawal of registration on a temporary or permanent basis
ga: D’fhéadfadh tarraingt siar an chláraithe ar bhonn sealadach nó buan eascairt as na ceisteanna sin

source: The Teaching Council provides information about making a complaint about a registered teacher
ga: Soláthraíonn an Chomhairle Múinteoireachta faisnéis maidir le gearáin faoi mhúinteoir cláraithe a dhéanamh

source: All the following organisations are professional bodies which set standards for their members
ga: Is iad na heagraíochtaí seo a leanas na comhlachtaí gairmiúla go léir a leagann amach caighdeáin dá mbaill

source: Institute of Chartered Accountants has a complaints mechanism which deals with complaints against its members
ga: Tá meicníocht ghearán i bhfeidhm ag Institiúid na gCuntasóirí Cairte a dhéileálann le gearáin a dhéantar i leith a gcomhaltaí

source: Institute of Certified Public Accountants has a code of ethics for its profession
ga: Tá cód eiticí dá bproifisiún ag Institiúid na gCuntasóirí Poiblí Teastaithe

source: Association of Chartered Certified Accountants has a complaints mechanism which deals with complaints against its members
ga: Tá meicníocht ghearán i bhfeidhm ag Comhlachas na gCuntasóirí Cairte a dhéileálann le gearáin a dhéantar i leith a gcomhaltaí

source: The Irish Association for Counselling and Psychotherapy sets standards and criteria for the practice of counselling and psychotherapy
ga: Leagann Cumann Comhairlithe agus Sícteiripe na hÉireann amach caighdeáin agus critéir do chleachtas na comhairleachta agus na síciteiripe

source: It has a Code of Ethics and Practice
ga: Tá Cód Eitice agus Cleachtais aige

source: You can take a complaint about a counsellor who is a member of this association
ga: Is féidir leat gearán a dhéanamh faoi chomhairleoir ar ball den eagraíocht seo é/í

source: There are statutory regulatory bodies for the medical professions
ga: Tá comhlachtaí reachtúla rialála ann do na gairmeacha leighis

source: In general, they promote high standards of professional conduct, maintain a register of qualified personnel and investigate allegations of professional misconduct or fitness to practice
ga: Go ginearálta, cuireann siad ardchaighdeáin d’iompar gairmiúil chun cinn, coimeádann siad clár de phearsanra cáilithe agus imscrúdaíonn siad líomhaintí i leith mí-iompar gairmiúil nó oiriúnachta chun cleachtadh

source: You can find more information about regulatory bodies for medical professionals on our website
ga: Féadfaidh tú teacht ar bhreis faisnéise faoi chomhlachtaí rialála le haghaidh gairmithe leighis ar ár láithreán gréasáin

source: The Private Security Authority (PSA), established under the Private Security Services Act 2004, is the statutory body with responsibility for regulating and licensing the Irish private security industry
ga: Is é an tÚdarás Slándála Príobháidí (USP), a bunaíodh faoin Acht um Sheirbhísí Slándála Príobháideacha 2004, an comhlacht reachtúil atá freagrach as tionscal slándála príobháidí na hÉireann a rialú agus a cheadúnú

source: It has been introducing licensing on a phased basis to the various sectors of the security industry
ga: Bhí ceadúnú á thabhairt isteach ar bhonn céimnithe do na hearnálacha éagsúla den tionscal slándála

source: Information on the sectors for which licences are required and on the requirements for identity badges (pdf) is available on the PSA website
ga: Tá fáil ar fhaisnéis ar na hearnálacha óna dteastaíonn ceadúnais agus ar na ceanglais le haghaidh suaitheantais aitheantais (pdf) ar láithreán gréasáin an Údarás Slándála Príobháidí (ÚSP)

source: A dispute with a bookmaker at a horse racecourse or greyhound track is handled by Horse Racing Ireland or the Irish Greyhound Board respectively
ga: Láimhseálann Rásaíocht Capall Éireann nó Bord na gCon, faoi seach, díospóid le geallghlacadóir ag ráschúrsa capall nó rásraon con

source: If you have a dispute with a bookmaker elsewhere, you may be able to refer the dispute to the Independant Betting Adjudication Service (IBAS) in the UK provided the bookmaker is registered with IBAS
ga: Má bhíonn díospóid agat le geallshealbhóir in áit eile, d’fhéadfá bheith in ann an díospóid a chur faoi bhráid na Seirbhíse Neamhspleáiche um Breithniú Gealltóireachta (SNBG) sa RA, a fhad agus go bhfuil an geallghlacadóir cláraithe leis an SNBG

source: Under the Gaming and Lotteries Act 1956, Section 36, a gaming or wagering contract is not enforceable and you cannot pursue a dispute through the courts
ga: Faoin Acht um Chearrbhachas agus Crannchuir, 1956, Alt 36, ní féidir conradh cearrbhachais nó geallchuir a chur i bhfeidhm agus ní féidir leat leanúint le díospóid trí na cúirteanna
